In [1]:
import pandas as pd

In [2]:
details= {'Roll Number':[2,14,16,27,30,38,42,44,48,50],'Name':['Priyal','Nikita','Chetan','Latha','Rama','Aarav','Noori','Suresh','Prem','Meera'],'Gender':['female','female','male','female','female','male','female','male','male','female'],'Marks1':[43,80,60,55,70,66,55,68,78,41],'Marks2':[30,73,50,30,45,67,63,43,23,46],'Marks3':[69,80,45,67,45,34,24,35,65,60]}
df=pd.DataFrame(details)

In [3]:
df['Total Marks']=df['Marks1']+df['Marks2']+df['Marks3']
df

   Roll Number    Name  Gender  Marks1  Marks2  Marks3  Total Marks
0            2  Priyal  female      43      30      69          142
1           14  Nikita  female      80      73      80          233
2           16  Chetan    male      60      50      45          155
3           27   Latha  female      55      30      67          152
4           30    Rama  female      70      45      45          160
5           38   Aarav    male      66      67      34          167
6           42   Noori  female      55      63      24          142
7           44  Suresh    male      68      43      35          146
8           48    Prem    male      78      23      65          166
9           50   Meera  female      41      46      60          147

In [4]:
min1=df['Marks1'].min()
min1

41

In [5]:
max2=df['Marks2'].max()
max2

73

In [6]:
df[['Marks3']].mean()

Marks3    52.4
dtype: float64

In [7]:
Havg=df[df['Total Marks']==df['Total Marks'].max()]
print((Havg['Name']))

1    Nikita
Name: Name, dtype: object

In [8]:
failed =df[df['Marks2']<40]
print((failed.shape[0]))

3

In [9]:
table=df.describe()
table

       Roll Number     Marks1     Marks2     Marks3  Total Marks
count    10.000000  10.000000  10.000000  10.000000    10.000000
mean     31.100000  61.600000  47.000000  52.400000   161.000000
std      16.196364  13.326665  16.719915  18.331515    26.886593
min       2.000000  41.000000  23.000000  24.000000   142.000000
25%      18.750000  55.000000  33.250000  37.500000   146.250000
50%      34.000000  63.000000  45.500000  52.500000   153.500000
75%      43.500000  69.500000  59.750000  66.500000   164.500000
max      50.000000  80.000000  73.000000  80.000000   233.000000